Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ256GP710.h
#define _AD1CON3_SAMC4_POSITION                  0x0000000C
#define _AD1CON3_SAMC4_MASK                      0x00001000
#define _AD1CON3_SAMC4_LENGTH                    0x00000001

#define _AD1CHS123_CH123SA_POSITION              0x00000000
#define _AD1CHS123_CH123SA_MASK                  0x00000001
#define _AD1CHS123_CH123SA_LENGTH                0x00000001

#define _AD1CHS123_CH123NA_POSITION              0x00000001
#define _AD1CHS123_CH123NA_MASK                  0x00000006
#define _AD1CHS123_CH123NA_LENGTH                0x00000002

#define _AD1CHS123_CH123SB_POSITION              0x00000008
#define _AD1CHS123_CH123SB_MASK                  0x00000100
#define _AD1CHS123_CH123SB_LENGTH                0x00000001

#define _AD1CHS123_CH123NB_POSITION              0x00000009
#define _AD1CHS123_CH123NB_MASK                  0x00000600
#define _AD1CHS123_CH123NB_LENGTH                0x00000002

#define _AD1CHS123_CH123NA0_POSITION             0x00000001
#define _AD1CHS123_CH123NA0_MASK                 0x00000002
#define _AD1CHS123_CH123NA0_LENGTH               0x00000001

#define _AD1CHS123_CH123NA1_POSITION             0x00000002
#define _AD1CHS123_CH123NA1_MASK                 0x00000004
#define _AD1CHS123_CH123NA1_LENGTH               0x00000001

#define _AD1CHS123_CH123NB0_POSITION             0x00000009
#define _AD1CHS123_CH123NB0_MASK                 0x00000200
#define _AD1CHS123_CH123NB0_LENGTH               0x00000001

#define _AD1CHS123_CH123NB1_POSITION             0x0000000A
#define _AD1CHS123_CH123NB1_MASK                 0x00000400
#define _AD1CHS123_CH123NB1_LENGTH               0x00000001

#define _AD1CHS0_CH0SA_POSITION                  0x00000000
#define _AD1CHS0_CH0SA_MASK                      0x0000001F
#define _AD1CHS0_CH0SA_LENGTH                    0x00000005

#define _AD1CHS0_CH0NA_POSITION                  0x00000007
#define _AD1CHS0_CH0NA_MASK                      0x00000080
#define _AD1CHS0_CH0NA_LENGTH                    0x00000001

#define _AD1CHS0_CH0SB_POSITION                  0x00000008
#define _AD1CHS0_CH0SB_MASK                      0x00001F00
#define _AD1CHS0_CH0SB_LENGTH                    0x00000005

#define _AD1CHS0_CH0NB_POSITION                  0x0000000F
#define _AD1CHS0_CH0NB_MASK                      0x00008000
#define _AD1CHS0_CH0NB_LENGTH                    0x00000001

#define _AD1CHS0_CH0SA0_POSITION                 0x00000000
#define _AD1CHS0_CH0SA0_MASK                     0x00000001
#define _AD1CHS0_CH0SA0_LENGTH                   0x00000001

#define _AD1CHS0_CH0SA1_POSITION                 0x00000001
#define _AD1CHS0_CH0SA1_MASK                     0x00000002
#define _AD1CHS0_CH0SA1_LENGTH                   0x00000001

#define _AD1CHS0_CH0SA2_POSITION                 0x00000002
#define _AD1CHS0_CH0SA2_MASK                     0x00000004
#define _AD1CHS0_CH0SA2_LENGTH                   0x00000001

#define _AD1CHS0_CH0SA3_POSITION                 0x00000003
#define _AD1CHS0_CH0SA3_MASK                     0x00000008
#define _AD1CHS0_CH0SA3_LENGTH                   0x00000001

#define _AD1CHS0_CH0SA4_POSITION                 0x00000004
#define _AD1CHS0_CH0SA4_MASK                     0x00000010
#define _AD1CHS0_CH0SA4_LENGTH                   0x00000001

#define _AD1CHS0_CH0SB0_POSITION                 0x00000008
#define _AD1CHS0_CH0SB0_MASK                     0x00000100
#define _AD1CHS0_CH0SB0_LENGTH                   0x00000001

#define _AD1CHS0_CH0SB1_POSITION                 0x00000009
#define _AD1CHS0_CH0SB1_MASK                     0x00000200
#define _AD1CHS0_CH0SB1_LENGTH                   0x00000001

#define _AD1CHS0_CH0SB2_POSITION                 0x0000000A
#define _AD1CHS0_CH0SB2_MASK                     0x00000400
#define _AD1CHS0_CH0SB2_LENGTH                   0x00000001

#define _AD1CHS0_CH0SB3_POSITION                 0x0000000B
#define _AD1CHS0_CH0SB3_MASK                     0x00000800
#define _AD1CHS0_CH0SB3_LENGTH                   0x00000001

#define _AD1CHS0_CH0SB4_POSITION                 0x0000000C
#define _AD1CHS0_CH0SB4_MASK                     0x00001000
#define _AD1CHS0_CH0SB4_LENGTH                   0x00000001

#define _AD1PCFGH_PCFG16_POSITION                0x00000000
#define _AD1PCFGH_PCFG16_MASK                    0x00000001
#define _AD1PCFGH_PCFG16_LENGTH                  0x00000001

#define _AD1PCFGH_PCFG17_POSITION                0x00000001
#define _AD1PCFGH_PCFG17_MASK                    0x00000002
#define _AD1PCFGH_PCFG17_LENGTH                  0x00000001

#define _AD1PCFGH_PCFG18_POSITION                0x00000002
#define _AD1PCFGH_PCFG18_MASK                    0x00000004
#define _AD1PCFGH_PCFG18_LENGTH                  0x00000001

#define _AD1PCFGH_PCFG19_POSITION                0x00000003
#define _AD1PCFGH_PCFG19_MASK                    0x00000008
#define _AD1PCFGH_PCFG19_LENGTH                  0x00000001

#define _AD1PCFGH_PCFG20_POSITION                0x00000004
#define _AD1PCFGH_PCFG20_MASK                    0x00000010
#define _AD1PCFGH_PCFG20_LENGTH                  0x00000001

#define _AD1PCFGH_PCFG21_POSITION                0x00000005
#define _AD1PCFGH_PCFG21_MASK                    0x00000020
#define _AD1PCFGH_PCFG21_LENGTH                  0x00000001

#define _AD1PCFGH_PCFG22_POSITION                0x00000006
#define _AD1PCFGH_PCFG22_MASK                    0x00000040
#define _AD1PCFGH_PCFG22_LENGTH                  0x00000001

#define _AD1PCFGH_PCFG23_POSITION                0x00000007
#define _AD1PCFGH_PCFG23_MASK                    0x00000080
#define _AD1PCFGH_PCFG23_LENGTH                  0x00000001

#define _AD1PCFGH_PCFG24_POSITION                0x00000008
#define _AD1PCFGH_PCFG24_MASK                    0x00000100
#define _AD1PCFGH_PCFG24_LENGTH                  0x00000001

#define _AD1PCFGH_PCFG25_POSITION                0x00000009
#define _AD1PCFGH_PCFG25_MASK                    0x00000200
#define _AD1PCFGH_PCFG25_LENGTH                  0x00000001

#define _AD1PCFGH_PCFG26_POSITION                0x0000000A
#define _AD1PCFGH_PCFG26_MASK                    0x00000400
#define _AD1PCFGH_PCFG26_LENGTH                  0x00000001

#define _AD1PCFGH_PCFG27_POSITION                0x0000000B
#define _AD1PCFGH_PCFG27_MASK                    0x00000800
#define _AD1PCFGH_PCFG27_LENGTH                  0x00000001

#define _AD1PCFGH_PCFG28_POSITION                0x0000000C
#define _AD1PCFGH_PCFG28_MASK                    0x00001000
#define _AD1PCFGH_PCFG28_LENGTH                  0x00000001

#define _AD1PCFGH_PCFG29_POSITION                0x0000000D
#define _AD1PCFGH_PCFG29_MASK                    0x00002000
#define _AD1PCFGH_PCFG29_LENGTH                  0x00000001

#define _AD1PCFGH_PCFG30_POSITION                0x0000000E
#define _AD1PCFGH_PCFG30_MASK                    0x00004000
#define _AD1PCFGH_PCFG30_LENGTH                  0x00000001

